// 2節 正の数・負の数の計算

// 1項 正の数・負の数の加法，減法
// ・正の数・負の数をたす計算
// ・2数の和の符号と絶対値, 0との和
export * from "./M71211_kahou_kihon";
// ・小数や分数の加法
// ・正の数・負の数をひく計算
export * from "./M71212_genpou_kihon";
export * from "./M71213_kagen_mix";
// ・正の数に符号＋をつけない加法，減法
export * from "./M71214_kakko_nasi";
// ・加法の計算法則と３数以上の加法，減法
export * from "./M71215_kagen_kongou";

// 2項 正の数・負の数の乗法，除法
// ・正の数をかけること
// ・負の数をかけること
export * from "./M71221_jyouhou";
// ・正の数・負の数でわること
export * from "./M71222_jyohou";
// ・2数の積・商の符号と絶対値，0との乗除
// ・小数をふくむ乗除
// ・分数をふくむ乗法
// ・逆数の意味
// ・除法を乗法になおすこと
// ・分数をふくむ除法
// ・乗法の計算法則と3数以上の乗除

// 3項 いろいろな計算
// ・指数の意味
// ・四則をふくむ式の計算
// ・分配法則

// 4項 数の世界のひろがり
// ・数の範囲の拡張と計算の可能性
// ・素数の意味
// ・自然数の素因数分解
// ・素因数分解によりどんな数の倍数であるかを判定すること
